---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.PipeConnectorsAreNotLined
source: html/51d8f359-bb91-982c-3393-b9b41b3c4ad5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.PipeConnectorsAreNotLined Property

A calculation did not complete because the connectors used by this family to connect to the network are not linked.

## Syntax (C#)
```csharp
public static FailureDefinitionId PipeConnectorsAreNotLined { get; }
```